TITLE: eprints.org Accueil

<center><img SRC="http://www.eprints.org/image/eprints-logo-large.jpg" BORDER=0  align=BOTTOM></center>

<p>Bienvenue sur <b>eprints.org</b>, dont le but est de proposer en ligne
des articles de recherche parus dans des revues &agrave; comit&eacute;
de lecture, gr&acirc;ce &agrave; un syst&egrave;me d'<a href="links.html#discussion">auto-archivage
par les auteurs/organismes</a>.
<p>Le <a href="software.html">logiciel</a> d'auto-archivage, <b>eprints.org</b>,
a &eacute;t&eacute; d&eacute;velopp&eacute; au <a href="http://www.ecs.soton.ac.uk/">D&eacute;partement
d'Electronique et d'Informatique</a> de l'<a href="http://www.soton.ac.uk/">Universit&eacute;
de Southampton</a>.
<p>Le logiciel <b>eprints</b> fonctionne d&eacute;j&agrave; sur le site
<a href="http://cogprints.soton.ac.uk/">CogPrints Cognitive Sciences Eprint
Archive</a>, un site d'archives ouvertes financ&eacute;es par le <a href="http://www.jisc.ac.uk/">JISC</a>
proposant des articles de recherche, avant et apr&egrave;s relecture par
les comit&eacute;s. <b>CogPrints</b> est une archive ouverte centralis&eacute;e
et class&eacute;e par discipline. Le logiciel <b>eprints</b> a &eacute;t&eacute;
modifi&eacute; pour &ecirc;tre aussi flexible et adaptable que possible
afin que les universit&eacute;s puissent l'utiliser et le configurer sans
difficult&eacute; et dans toutes les disciplines. Il compl&egrave;te ainsi
l'archivage centralis&eacute; par discipline par un archivage local, distribu&eacute;
par les organismes.
<p>La version g&eacute;n&eacute;rique de <b>eprints</b> est enti&egrave;rement
<b>interop&eacute;rable</b> avec toutes les autres archives ouvertes participant
&agrave; l'<a href="http://www.openarchives.org/">Open Archives Initiative</a>.
Cela signifie que le site d'archivage n'a plus aucune importance ; les
articles de toutes les archives ouvertes enregistr&eacute;es comme <a href="http://www.openarchives.org/sfc/sfc_archives.htm">Fournisseurs
de Donn&eacute;es des Archives Ouvertes</a> peuvent &ecirc;tre regroup&eacute;s
dans une "archive virtuelle" globale par les <a href="http://www.openarchives.org/sfc/sfc_services.htm">Fournisseurs
de Service d'Archives Ouvertes </a>tel que le <a href="http://arc.cs.odu.edu/">Service
de Recherche Crois&eacute;e entre les Archives</a>.&nbsp;
<p>Une version ant&eacute;rieure b&ecirc;ta priv&eacute;e d'<b>eprints</b>
a remport&eacute; l'unanimit&eacute;. La premi&egrave;re version int&eacute;grale
(et gratuite &eacute;videmment) est disponible depuis le 1er d&eacute;cembre
2000.
<p>Pour plus d'informations techniques &agrave; propos du logiciel, consultez
la <a href="http://www.eprints.org/fr/software.html">page logiciel</a>.
Si vous souhaitez &ecirc;tre inform&eacute; par message &eacute;lectronique
de la disponibilit&eacute; du logiciel, vous pouvez vous abonner &agrave;
une <a href="list.html">liste de diffusion</a>.
<br>&nbsp;
