TITLE: eprints.org: A Propos du Logiciel

<BR />
<BR />

<H1>A propos du logiciel eprints.org</H1>

<P><A HREF="http://www.eprints.org/">Retour &agrave; la page anglaise</A>
<I> (Version Fran&ccedil;aise: 
<A HREF="http://www.tours.inra.fr/tours/doc/comsci.htm">
G. Rigou et H&eacute;l&egrave;ne Bosc</A>
; beaucoup de remerciements aussi &agrave;
<A HREF="http://www.fas.umontreal.ca/LITTCO/employes/GUEDONJean-Claude.html">
Jean-Claude Gu&eacute;don</A>)</I></P>

<P>
Voir aussi:
<BR>
<A HREF="http://www.inra.fr/Internet/Directions/DIC/ACTUALITES/PubElectro2903/crInraInserm.htm#4repenser">
http://www.inra.fr/Internet/Directions/DIC/ACTUALITES/PubElectro2903/crInraInserm.htm#4repenser</A>
<BR>
et
<BR>
<A
HREF="http://www.cogsci.soton.ac.uk/~harnad/Papers/Harnad/harnad97.revues.francais.html">
http://www.cogsci.soton.ac.uk/~harnad/Papers/Harnad/harnad97.revues.francais.html</A></P>

<P>
La premi&egrave;re version compl&egrave;te du logiciel <B>eprints.org</B>
devrait &ecirc;tre disponible en novembre 2000. Pour le moment,
une version b&ecirc;ta publique peut &ecirc;tre <A HREF="http://www.cogsci.soton.ac.uk/~harnad/Temp/download.html">t&eacute;l&eacute;charg&eacute;e</A>
pour &ecirc;tre test&eacute;e et &eacute;valu&eacute;e. Pour &ecirc;tre
inform&eacute; des parutions et autres informations par courrier &eacute;lectronique,
vous pouvez vous abonner &agrave; une <A HREF="http://www.cogsci.soton.ac.uk/~harnad/Temp/list.html">liste
de diffusion</A>.</P>
<P>Pour plus d'informations, envoyez un message &agrave; <A HREF="mailto:info@eprints.org">info@eprints.org</A>.</P>

<H2>Caract&eacute;ristiques</H2>

<ITEMS>

<ITEM>Facilit&eacute; d'installation et de lancement. Dans le cas le plus
simple, &eacute;ditez les fichiers de configuration, lancez le programme
d'installation et le site fonctionne.</ITEM>

<ITEM>Possibilit&eacute; d'enregistrer les documents au format que vous (administrateur
des archives) pr&eacute;f&eacute;rez. Tout article de recherche (ou <I>e-print</I>)
peut &ecirc;tre enregistr&eacute; sous plusieurs formats.</ITEM>

<ITEM>L'administrateur des archives peut &eacute;galement choisir les m&eacute;tadonn&eacute;es
pour chaque e-print. Ceci est possible en trois ou quatre &eacute;tapes:
<BR><BR>
<OL>
<LI>
Choisir un nombre maximum d'&eacute;l&eacute;ments de m&eacute;tadonn&eacute;es
pouvant &ecirc;tre enregistr&eacute;s (par exemple, "auteurs", "titre",
"revue", "n&deg; de volume", etc.)</LI>

<LI>
Choisir les types d'e-print qui seront enregistr&eacute;s (par exemple,
article de revue &agrave; comit&eacute; de lecture, th&egrave;se, rapport
technique, pre-print non publi&eacute;)</LI>

<LI>
Choisir les &eacute;l&eacute;ments de m&eacute;tadonn&eacute;es qui devront
&ecirc;tre enregistr&eacute;s pour tous les e-prints de m&ecirc;me type,
en pr&eacute;cisant les &eacute;l&eacute;ments obligatoires.</LI>

<LI>
Choisir comment les &eacute;l&eacute;ments de m&eacute;tadonn&eacute;es
doivent &ecirc;tre reprises dans les <A HREF="http://www.openarchives.org/sfc/sfc_oams.htm">Open
Archives</A>. (Si n&eacute;cessaire, l'interop&eacute;rabilit&eacute; peut
&ecirc;tre inactiv&eacute;e, mais c'est fortement d&eacute;conseill&eacute;.)</LI>
</OL>
</ITEM>

<ITEM>Les e-prints peuvent &ecirc;tre archiv&eacute;s selon un plan de classement
hi&eacute;rarchis&eacute;. Ce classement peut &ecirc;tre utilis&eacute;
pour visualiser et effectuer une recherche dans les archives.</ITEM>

<ITEM>La d&eacute;position de tous les e-prints s'effectue via une interface web
simple mais extr&ecirc;mement puissante. Les articles peuvent &ecirc;tre
t&eacute;l&eacute;charg&eacute;s vers le serveur comme de simples fichiers,
dans un format compress&eacute; (un fichier <B>.zip</B> par exemple), ou
automatiquement et int&eacute;gralement copi&eacute;s d'un site ou ils sont
d&eacute;ja stock&eacute;s,
en indiquant l'URL.</ITEM>


<ITEM>L'int&eacute;grit&eacute; des donn&eacute;es est v&eacute;rifi&eacute;e
automatiquement sans que l'administrateur ait besoin d'intervenir. Des
bouts de 
routines permettent &agrave; des sites individuels d'int&eacute;grer
leur propre routine de v&eacute;rification d'int&eacute;grit&eacute; si
besoin est. Ces v&eacute;rifications simplifient consid&eacute;rablement
le travail de l'administrateur du site.</ITEM>

<ITEM>Des m&eacute;tadonn&eacute;es peuvent &ecirc;tre associ&eacute;es aux
auteurs. L'administrateur peut l&agrave; encore choisir les &eacute;l&eacute;ments
de m&eacute;tadonn&eacute;es qui seront enregistr&eacute;s avec les coordonn&eacute;es
de chaque auteur.</ITEM>

<ITEM>Les utilisateurs peuvent s'abonner en tant qu'auteur ou lecteur, gr&acirc;ce
&agrave; un formulaire web ou un compte e-mail g&eacute;r&eacute; automatiquement.</ITEM>

<ITEM>Les utilisateurs peuvent s'abonner &agrave; un service d'e-mails. Chaque
utilisateur pr&eacute;cise ses domaines favoris et peut alors choisir de
recevoir par e-mail les r&eacute;sum&eacute;s des nouvelles d&eacute;positions
dans ces domaines.</ITEM>

<ITEM>Les articles d&eacute;pos&eacute;s 
(si l'administrateur le souhaite) font l'objet d'une
proc&eacute;dure de mod&eacute;ration. Les papiers d&eacute;pos&eacute;s 
sont mis en attente
jusqu'&agrave; &ecirc;tre approuv&eacute;s par le mod&eacute;rateur, rejet&eacute;s
cat&eacute;goriquement ou retourn&eacute; &agrave; l'auteur pour modifications.
(Cette mod&eacute;ration est sp&eacute;cifique &agrave; chaque organisme
participant aux archives : &agrave; <A HREF="http://cogprints.soton.ac.uk/">CogPrints</A>,
nous l'utilisons pour nous assurer que le sujet trait&eacute; est appropri&eacute;
et que toutes les figures apparaissent correctement.)</ITEM>

<ITEM>Cette proc&eacute;dure de mod&eacute;ration s'effectue &eacute;galement
gr&acirc;ce &agrave; une interface web. En fait, quand le site fonctionnera,
il y aura tr&egrave;s peu de travaux de maintenance qui ne pourront pas
&ecirc;tre r&eacute;alis&eacute;s par l'interface web de maintenance.</ITEM>

</ITEMS>


<H2>Configuration requise</H2>

<P>L'un des objectifs majeurs de ce travail a &eacute;t&eacute; de rendre
ce syst&egrave;me fonctionnel &agrave; moindre co&ucirc;t. Les seuls frais
seront le co&ucirc;t du mat&eacute;riel. Le mat&eacute;riel et les logiciels
requis sont:</P>

<ITEMS>

<ITEM>Un PC fonctionnant sous UNIX. Evidemment, plus le PC est rapide, mieux
&ccedil;a fonctionne, mais tout processeur Intel Pentium II permettra de
bonnes performances.</ITEM>

<ITEM>Un syst&egrave;me d'exploitation UNIX. <A HREF="http://www.linux.org/">Linux</A>
(un syst&egrave;me UNIX tr&egrave;s performant et gratuit) suffit amplement.
En fait, il s'agit de la plate-forme de d&eacute;veloppement.</ITEM>

<ITEM>Le <A HREF="http://www.apache.org/httpd.html">serveur WWW Apache</A>,
un autre logiciel gratuit de qualit&eacute; professionnelle, souvent inclus
dans les distributions <A HREF="http://www.linux.org/">Linux</A>, tel que
<A HREF="http://www.redhat.com/">RedHat</A>.</ITEM>

<ITEM>Le <A HREF="http://www.perl.com/">langage de programmation Perl</A>,
&eacute;galement compris avec la plupart des distributions <A HREF="http://www.linux.org/">Linux</A>.
(Ainsi qu'un petit nombre de modules suppl&eacute;mentaires, plus de d&eacute;tails
seront disponibles ult&eacute;rieurement.)</ITEM>

<ITEM>Le module <A HREF="http://perl.apache.org/">mod_perl</A> pour <A HREF="http://www.apache.org/httpd.html">Apache</A>,
qui augmente de mani&egrave;re significative la performance des scripts
<A HREF="http://www.perl.com/">Perl</A>.
Notez que le mod_perl fourni avec RedHat 6.2 (architecture i386) ne fonctionne
pas, il doit &ecirc;tre remplac&eacute; par ce <A HREF="http://www.cogsci.soton.ac.uk/~harnad/Temp/mod_perl-1.23-1.i386.rpm">RPM</A>.</ITEM>

<ITEM>La <A HREF="http://www.mysql.com/">base de donn&eacute;es MySQL</A>,
qui est un syst&egrave;me de base de donn&eacute;es gratuit &agrave; usage
non commercial. (Vous trouverez le texte de la licence <A HREF="http://www.mysql.com/Manual_chapter/manual_Licensing_and_Support.html">ici</A>.)
L'acc&egrave;s &agrave; la base de donn&eacute;es s'effectue gr&acirc;ce
&agrave; un seul module, et le gestionaire de la base de donn&eacute;es
pourra facilement &ecirc;tre remplac&eacute; si vous le souhaitez.</ITEM>

<ITEM>Et le logiciel <B>eprints.org</B>!</ITEM>

</ITEMS>


<P>Quand les logiciels sont install&eacute;s, la mise en place du logiciel
<B>eprints.org</B>
se fait en &eacute;ditant quelques fichiers de configuration et en lan&ccedil;ant
le programme d'installation. Les archives fonctionnent, vous pourrez d&egrave;s
lors utiliser le syst&egrave;me &agrave; votre guise (ou &agrave; celle
de votre organisme de travail).</P>

<P><A HREF="http://www.eprints.org/">
Retour &agrave; la page anglaise</A></P>
